{
    //CONFIG
    "Config.section.CToggle.name": "Character Toggle",
    "Config.section.CToggle.description": "Toggle individual characters' changes on or off.",
    "Config.Abigail_Toggle.name": "Abigail",
    "Config.Alex_Toggle.name": "Alex",
    "Config.Caroline_Toggle.name": "Caroline",
    "Config.Clint_Toggle.name": "Clint",
    "Config.Demetrius_Toggle.name": "Demetrius",
    "Config.Dwarf_Toggle.name": "Dwarf",
    "Config.Elliott_Toggle.name": "Elliott",
    "Config.Emily_Toggle.name": "Emily",
    "Config.Evelyn_Toggle.name": "Evelyn",
    "Config.George_Toggle.name": "George",
    "Config.Gus_Toggle.name": "Gus",
    "Config.Haley_Toggle.name": "Haley",
    "Config.Harvey_Toggle.name": "Harvey",
    "Config.Jas_Toggle.name": "Jas",
    "Config.Jodi_Toggle.name": "Jodi",
    "Config.Kent_Toggle.name": "Kent",
    "Config.Krobus_Toggle.name": "Krobus",
    "Config.Leah_Toggle.name": "Leah",
    "Config.Leo_Toggle.name": "Leo",
    "Config.Lewis_Toggle.name": "Lewis",
    "Config.Linus_Toggle.name": "Linus",
    "Config.Marnie_Toggle.name": "Marnie",
    "Config.Maru_Toggle.name": "Maru",
    "Config.Pam_Toggle.name": "Pam",
    "Config.Penny_Toggle.name": "Penny",
    "Config.Pierre_Toggle.name": "Pierre",
    "Config.Robin_Toggle.name": "Robin",
    "Config.Sam_Toggle.name": "Sam",
    "Config.Sandy_Toggle.name": "Sandy",
    "Config.Sebastian_Toggle.name": "Sebastian",
    "Config.Shane_Toggle.name": "Shane",
    "Config.Vincent_Toggle.name": "Vincent",
    "Config.Willy_Toggle.name": "Willy",
    "Config.Wizard_Toggle.name": "Wizard",

    "Config.section.Misc.name": "Miscellaneous Settings",
    //"Config.section.Misc.description": "Left blank for now.",
    "Config.Shane_AlcoholLines_Toggle.name": "Toggle Shane's alcohol lines",
    "Config.Shane_AlcoholLines_Toggle.description": "If set to false, removes the lines related to gifting Shane alcohol. This is primarily for compatibility with mods that modify Shane's tastes more thoroughly.",

    //Abigail
    "UGDE.Abigail_Mayo1": "Hey, a jar of mayo! Bottoms up! Just kidding... Or am I?",
    "UGDE.Abigail_Mayo2": "I ate mayo straight out of the jar once to prank my mom... I don't think she ever recovered!",
    "UGDE.Abigail_Mayo3": "Then I did it again with Sam and Sebastian. Good times.#$b#So who do you think I should scare next?",
    "UGDE.Abigail_(O)128": "Woah, that fish looks so weird! I love it!",
    "UGDE.Abigail_(O)276_LateFall": "The best thing about pumpkins is that nothing goes to waste. The inside is tasty and the outside makes a sick jack-o-lantern! Thanks!",
    "UGDE.Abigail_(O)276_NotFall": "That looks mouthwatering... Thank you, @!",
    "UGDE.Abigail_Birthday(O)276": "Woah! A pumpkin on my birthday!? That's some fertilizer you're using! Thanks a lot, @!$h#$e#You have no idea the kind of existential anguish being born *juuust* a tad too early for your favorite treat to be in bloom in time for your birthday can cause.",

    //Alex
    "UGDE.Alex_(O)306": "Proteins and calories, the building blocks of champions! Thanks, @!$h#$e#Now... Let's dig in! *slurp* *munch* *munch* *gulp* Time! That's a new record!$0",
    "UGDE.Alex_BirthdayGiftLiked": "A birthday gift? Thanks @! That's kinda cool.",
    "UGDE.Alex_BirthdayGiftNeutral": "This is for my birthday, right? Thanks!",

    //Caroline
    "UGDE.Caroline_(O)213": "Ah, a tuna taco...! How did you know I love this? Thank you, @!$h#$e#Willy sells his own fish, so it is rare we have any in store. I don't get to make those as often as I wish...",
    "UGDE.Caroline_Mayo1": "Ah... Sorry, just... I can't look at mayonnaise the same way ever since Abigail...$s",
    "UGDE.Caroline_Mayo2": "I can still cook with it mind you, but seeing a fresh unopened jar gives me the shivers.$s#$b#I have to ask Pierre to open them for me...",
    "UGDE.Caroline_(O)276_LateFall": "Is this for Spirit's Eve? I'll get Abigail to help me carve it... Thanks.",
    "UGDE.Caroline_(O)276_NotFall": "Ah! My daughter loves pumpkins. It seems I'll be making soup tonight! Thanks, @.",


    //Clint
    "UGDE.Clint_category_gem": "Huh. Quality gem. You've got a good eye for mining, @.",
    "UGDE.Clint_(O)60": "That's a nice looking emerald. I could make a fetching ring out of that... You're securing my profits for this week with that, @. Thanks!$h#$e#The adventurer's guild regularly commissions me for rings, if you were wondering where they were coming from. Do they even do anything?",
    "UGDE.Clint_(O)62": "An aquamarine! You know, despite the name, the only thing they've got in common with the sea is the color. Thanks, @.$h",
    "UGDE.Clint_(O)64": "Hmm... Yep, that's an authentic ruby! Pretty, and valuable! Thank you, @!$h",
    "UGDE.Clint_(O)66": "You're just giving me an amethyst? ...Thanks, @.$h#$e#I like working with amethysts, it's a pleasant challenge to shape. Not too hard, not too easy.",
    "UGDE.Clint_(O)68": "A topaz! The bread and butter of gemsmithing. It's sure to sell fast. Thanks!$h#$e#I know the proper term is jewelry making, but gemsmithing has a nicer ring to it, don't you agree?",
    "UGDE.Clint_(O)70": "Ah, a piece of jade! It's a favorite of miners, which means an easy sale for me, heheh!$h#$e#I heard about these new crystalariums... Apparently, jades are one of the most duplicated gems. Careful these machines don't put you out of a job, @.",
    "UGDE.Clint_(O)72": "A diamond!? Oh boy... Don't misunderstand, I'm grateful, they're just so hard to work with... Thank you, @.$s",
    "UGDE.Clint_(O)74": "Is that a prismatic shard!? Never thought I'd see one this close...! I don't know what to say, thank you @!$h#$e#I wish I had a tidbit for you, but these are genuinely so rare. I don't know what I'll even make with that one!$h",
    "UGDE.Clint_(O)Book_Friendship": "What is that supposed to mean? Rude.$a#$b#Wait... Are you just looking out for me? ...Okay, I'll read it. Maybe this can help me with... Never mind. Thanks, @.",
    "UGDE.Clint_furnace_item": "You got a good handle on those furnaces of yours. I always welcome more raw material to work with!",
    "UGDE.Clint_(O)910": "What is wrong with you!? Are you trying to irradiate us all to death!? Get that out of my forge immediately!",
    "UGDE.Clint_(O)338": "I can find an use or two for this. Thanks.#$e#Quartz has many interesting properties that make it very versatile, but it's pretty affordable. Still, a gift's a gift.",

    //Demetrius
    "UGDE.Demetrius_(O)207": "A healthy source of carbohydrates, and delicious to boot! What isn't there to love? Thank you!$h#$e#Truth be told, my other favorites are on the dessert side...",
    "UGDE.Demetrius_(O)233": "How wonderful! I should probably devour this before it melts. *sluuurp sluuurp*#$e#It's healthy to let your inner child out sometimes. For me, ice cream does it without fail.",
    "UGDE.Demetrius_(O)232": "A homemade rice pudding! I love the creamy and chewy texture of this dessert.$h#$e#From what I have observed, most people care only about the taste of their food, but texture is equally important to me.",
    "UGDE.Demetrius_(O)400_1": "Did you grow these on your farm? They look ripe and delicious!$h",
    "UGDE.Demetrius_(O)400_2": "The mineral makeup of the valley is especially conducive to the growth of strawberries. Maru is just as fond of them as I am.",

    //Dwarf
    "UGDE.Dwarf_(O)554": "Oh ho! It is rare that I get to have one of these!#$e#If you were wondering about a comparison... I suppose these would be akin to your human \"cheeses\", to us.",
    "UGDE.Dwarf_(O)121": "This looks... worn. Another remain from my ancestors, most likely. Thank you, human.",
    "UGDE.Dwarf_(O)122": "I wish I knew how to operate this. This is definitely one of ours...#$e#I heard that there is a giant Dwarvish machine still functional on an island south of there... I hope to go see it some day.",
    "UGDE.Dwarf_ScrollIntro": "Hmm... This dialect is quite outdated, I don't think you could read this even if you tried.#$b#This scroll is part of a series that details the ancient story of our people.",
    "UGDE.Dwarf_Scroll1_1st": "It describes what our life used to be like, when our civilization was at its peak.#$b#Our technology was without equal... but I suppose you already knew that.",
    "UGDE.Dwarf_Scroll1_nth": "This scroll describes what our life used to be like, when our civilization was at its peak.#$b#Our technology was without equal... but I suppose you already knew that.",
    "UGDE.Dwarf_Scroll2_1st": "It tells of a catastrophe, One that threatened to end dwarfkind.#$b#From the wording... Hmm. It could've been anything from a volcanic eruption to an asteroid.#$b#It could even be meant metaphorically... The lack of clarity frustrates me.",
    "UGDE.Dwarf_Scroll2_nth": "This scroll tells of a catastrophe, One that threatened to end dwarfkind.#$b#From the wording... Hmm. It could've been anything from a volcanic eruption to an asteroid.#$b#It could even be meant metaphorically... The lack of clarity frustrates me.",
    "UGDE.Dwarf_Scroll3_1st": "It explains that our ancestors built a massive ship capable of transporting millions.#$b#They sought to leave no one behind, but time was against them.#$b#Eventually, they departed, starting a long voyage in search of a new home.",
    "UGDE.Dwarf_Scroll3_nth": "This scroll explains that our ancestors built a massive ship capable of transporting millions.#$b#They sought to leave no one behind, but time was against them.#$b#Eventually, they departed, starting a long voyage in search of a new home.",
    "UGDE.Dwarf_Scroll4_1st": "It says that our people's voyage came to an end rather abruptly.#$b#They weren't intending on settling in an already inhabited land, but their ship was irreparably damaged during the landing.#$b#Most of our records were lost in the crash... Oral lore could only preserve so much.#$b#With no other choice, our people settled underground, rebuilding our lives anew.",
    "UGDE.Dwarf_Scroll4_nth": "This scroll says that our people's voyage came to an end rather abruptly.#$b#They weren't intending on settling in an already inhabited land, but their ship was irreparably damaged during the landing.#$b#Most of our records were lost in the crash... Oral lore could only preserve so much.#$b#With no other choice, our people settled underground, rebuilding our lives anew.",
    "UGDE.Dwarf_(O)78_Tuesday": "Heard me muttering earlier, I see... Did you bring one back just for me? That's very kind, human.",
    "UGDE.Dwarf_(O)78_NotTuesday": "A cave carrot! I could eat these every day. Thanks.",
    "UGDE.Dwarf_Carrot": "Is this a surface carrot? I didn't expect it to be so... orange.",
    "UGDE.Dwarf_(O)162": "Hahahah, excellent catch! You wouldn't make half bad a dwarf!",
    "UGDE.Dwarf_(O)226": "Intriguing! What a mellow taste... This is unmistakably a human version of the classic seared lava eel, but how did you make it so mild?",


    //Elliott
    "UGDE.Elliott_(O)715": "A beautiful lobster! Visualize it grilled over a campfire... Tonight, I shall enjoy a crustacean feast!$h#$e#I wouldn't be living on the beach if I didn't enjoy seafood.",

    //Emily
    "UGDE.EmilyBlessingName": "Emily's Blessing",
    "UGDE.Emily_(O)72": "Can you feel it? The pure divine energy emanating from this gem? It is so wonderful...$h#$e#May Yoba bless you on this lovely day.$7", //Hey, so. Turns out. If you're married to Emily and it is exactly the 2nd of Summer, she'll say this exact line as well. I had never seen it before, I just encountered it on the wiki and I was flabbergasted. I thought someone had mistaken a line from my mod as vanilla and added it to the wiki, but... no. It's in there. MarriageDialogueEmily.json summer_2. My mind is blown. Exact wording and everything, yet a total coincidence. I... guess I understand Emily's character voice better than I thought?
    "UGDE.Emily_(O)74": "How wonderful... A cocktail of positive energy, flowing all around us! So this is the power of a Prismatic Shard...$h#$e#This'll brighten the vibes of our living room immensely!$h",
    "UGDE.Emily_(O)634_Early": "Oh! I didn't expect %farm Farm to be growing fruit trees already. Or is this a gift from a forest friend? Thanks!$h#$e#I do like the taste of apricot at this time of year, but Pierre usually has me covered.",
    "UGDE.Emily_(O)634_AfterQuest": "How sweet of you, another apricot! Your care for the people around you shines through in this gift.$h", //...Maybe too much?

    //Evelyn
    "UGDE.Evelyn_(O)20_Early": "Thank you, dear. Give this to George next time, I know he would enjoy it very much.",
    "UGDE.Evelyn_(O)20_AfterSpecial": "It was so kind of you to help with George's surprise gift. I'll make sure this finds him too.",
    "UGDE.Evelyn_category_flowers": "Ah, don't they look and smell lovely...! I will find a matching vase to put them in. Thank you, dear.$h",
    "UGDE.Evelyn_(O)595": "Oh my, I wouldn't mind a little visit from a friendly fairy! Maybe this will be just what I need to invite one over tea...$h#$e#I spotted one near your farm once, when I was much younger. Of course, it was your grandfather's at the time...",
    "UGDE.Evelyn_Raisins_1": "These taste just wonderful, my dear! Good old %farm Farm raisins... How I missed the taste.$h",
    "UGDE.Evelyn_Raisins_2": "Your grandfather used to make so many of these ahead of any harvest, more than I could ever buy from him.#$b#I must not have been the only raisin lover in the Valley... *wink*",
    "UGDE.Evelyn_BirthdayGiftPositive": "Oh, this is very kind of you, dear! Even after all these years, my birthday still feels special.",
    "UGDE.Evelyn_BirthdayGiftNegative": "Oh... Is this a birthday gift? Bless your heart, dear.",

    //George
    "UGDE.George_(O)20": "*sniff sniff* That amazing smell... Did she put you up to this? Bah, this is great either way!$h",
    "UGDE.George_(O)205": "Now that takes me back... You know how to make an old man happy. Eaten my fair share of these back in the day!$h#$e#The wife doesn't do fried foods these days... Says it's bad for my heart.#$b#But I'll go out how I darn please if it means with a smile on my face!$h",
    "UGDE.George_(O)260_Early": "Hmm? *grumble* #$e#Don't think I need any, do I? Bah, I'm sure I've got enough.$2#$b#Hey, can't an old man mumble to himself in peace? Go away.$3",
    "UGDE.George_(O)260_AfterQuest": "My knee's doing fine today, but thanks. I'll stash that one for another day.#$b#Yoba knows the thing acts up as it pleases.",
    "UGDE.George_(O)284": "A beet...#$b#...#$b#That's Evelyn's favorite. But you didn't hear it from me, alright?",
    "UGDE.George_BirthdayGiftPositive": "Why am I not surprised to see you remembered my birthday?$h#$e#Look, @... I know I can be... unappreciative, sometimes.$s#$b#But it's nice to know someone around here cares about us oldies. You're a good kid.$h",
    "UGDE.George_BirthdayGiftNeutralOrUnfriendly": "Another year, another step closer to the grave...$2#$b#Hmm? A birthday gift? Sure.$0", //Plays for neutral gifts, and for positive gifts when under 6 hearts with George.
    "UGDE.George_BirthdayGiftNegative": "Another year, another step closer to the grave...$2#$b#Hmm? A birthday gift?$0#$b#...Yoba, if you exist, just take me already.$3",

    //Gus
    "UGDE.Gus_(O)72": "Ah! So you noticed the bear statue's missing eye? This will make a perfect replacement, @!$h",
    "UGDE.Gus_(O)265_1": "How does the smell *taste* inky...?$s",
    "UGDE.Gus_(O)265_2": "I'm not sure how Willy can eat this stuff, but he looks forward to the moonlight jellies every year thanks to it.",
    "UGDE.Gus_(O)203_1": "Ah... my worst mistake. I was hoping its recipe hadn't spread...$s",
    "UGDE.Gus_(O)203_2": "Every once in a while I have it in stock at Shane's request, but even he told me it's \"just okay\".#$b#Don't ask where I get the mayo from.$s",
    "UGDE.Gus_(O)729": "The plating could use some work, but... ah. Unassuming, yet so delicious. 'Bon appétit'!$h",
    "UGDE.Gus_(O)648": "Why would you do this to a perfectly good cabbage...",
    "UGDE.Gus_(O)213_1": "Now that's a proper use for a red cabbage! The tuna really helps bring it all together. Thanks!",
    "UGDE.Gus_(O)213_2": "I wouldn't recommend gifting one to Emily. It could be a fish allergy? I'm not sure...#$b#I've seen her turn up her nose at more than a few fish-based dishes.",
    "UGDE.Gus_AcceptBirthdayGift_Positive": "Oh, for my birthday? There was really no need, but thank you!$h",
    "UGDE.Gus_AcceptBirthdayGift_Negative": "A birthday gift? ...Oh. Hm. Thanks...$s",

    //Haley
    "UGDE.Haley_(O)221_early": "Is this the Queen of Sauce's famous pink cake? I've been dying for another bite for so long! Thanks!$h#$e#I sent a letter to the show asking for the recipe, but they must be backed up...",
    "UGDE.Haley_(O)221_year2NoRecipe": "Is this the Queen of Sauce's famous pink cake? So you caught the episode too, then!$h#$e#What? ...No? Well, lucky you, I taped it! Here.#$b#%You learned the recipe for Pink Cake!",
    "UGDE.Haley_(O)221_year2RecipeKnown": "Ah... Who would've guessed that amazing flavor was melon? The Queen of Sauce's recipes are always delicious.$h#$b#Did you see the moment when she read my letter?$h",
    "UGDE.Haley_BirthdayGiftNeutral": "Is this for my birthday? It's kind of ok, I guess. Thanks for the gift.",
    "UGDE.Haley_(O)74_1": "Urgh. I'm sorry but no. This is just... so tacky.$5",
    "UGDE.Haley_(O)74_2": "Three colors per ensemble, max. A jewel like that can't be paired with anything.$3",

    //Harvey
    "UGDE.Harvey_(O)395": "I can't start the day without a cup... Ah, and this one smells fantastic!$h#$e#I usually drink coffee black, but I'm not against adding milk either.#$b#It's a well-known source of calcium.",
    "UGDE.Harvey_BeachForage": "That, I am *definitely* allergic to! $2",
    "UGDE.Harvey_(O)152": "A seaweed...? ...Why?",

    //Jas
    "UGDE.Jas_Cake_1": "I hope this cake is as delicious as it is pretty! I love it! *giggle*$h",
    "UGDE.Jas_Cake_2a": "I wonder if I should share with Vincent and Miss Penny... The cake is pretty big.$u",
    "UGDE.Jas_Cake_2b": "I wonder if I should share with Shane and Aunt Marnie... The cake is pretty big.$u",
    "UGDE.Jas_category_artisan_goods": "I don't think this is for kids.$s", //I originally had her twisting her tongue trying to pronounce appropriate, but that's too kiddy for her.

    //Jodi
    "UGDE.Jodi_category_cooking": "Trying out cooking? Maybe you, Gus and I should swap recipes...$h#$e#There's no better path to a hefty cookbook than befriending people, if you ask me.#$b# Everybody's got a recipe or two they share with friends!$h",
    "UGDE.Jodi_(O)265": "No thank you.",
    "UGDE.Jodi_(O)203": "Isn't that Gus's...?$4#$b#Oh, it is. Blech...$s#$e#Not every experiment comes to fruition, let's say...",
    "UGDE.Jodi_(O)190_Early": "A cauliflower! Hmm... You've given me a few ideas. Thank you.#$e#I'll experiment with a few dishes using this one... If all goes well, I might request another soon, alright?",
    "UGDE.Jodi_(O)190_AfterQuest": "Another cauliflower! Thank you.#$e#It's hard to get Vincent to eat his greens, but yellow curry always does the trick.",
    "UGDE.Jodi_AcceptBirthdayGift_Positive": "Oh, what a wonderful birthday gift! Thank you!$h",
    "UGDE.Jodi_AcceptBirthdayGift_Negative": "Ah... For my birthday? It's not worse than Vincent's gift, I suppose...$s",

    //Kent
    "UGDE.Kent_category_cooking": "This isn't as good as my wife's meals, but it's close. Thanks.$h#$e#Never trust a man whose favorite food isn't their spouse's cooking. Tip from a soldier.",
    "UGDE.Kent_(O)607_1": "This brings back good memories... Thanks.$h",
    "UGDE.Kent_(O)607_2": "I used to make these myself when I was a kid, playing in the forest.$h#$b# I'd start a campfire like I was taught and roast them over an open flame.$h#$b#I took fire safety very seriously, and always triple-checked that I'd doused it properly.$5",
    "UGDE.Kent_(O)607_3": "That meticulous attitude ended up saving my life on the battlefield...$2#$b#Don't tell Jodi I said that.$0",
    "UGDE.Kent_AcceptBirthdayGift_Positive": "Do you give birthday gifts to everyone in town? That's very neighborly.$h",
    "UGDE.Kent_AcceptBirthdayGift_Negative": "A gift for my birthday? They can't all be winners, I suppose.$s",
  
    //Krobus
    "UGDE.Krobus_(O)203": "May I...? *munch munch* Oh wow... Is this really human cuisine? I've never tasted anything more delicious!$h#$e#Most of your people's cooking has disappointed me, but this is an exception.",
    "UGDE.Krobus_(O)265": "It kind of smells like the sewers, but... better. Thank you.",
    "UGDE.Krobus_(O)16": "This has such a soft, sweet taste! I love it!$h",

    //Leah
    "UGDE.Leah_(O)348": "Oh, this look great! Did you make that on your farm?$h#$e#I like to unwind with a glass of wine at the end of a fruitful day... ha! Fruitful. That pun wasn't on purpose.$h",
    "UGDE.Leah_BirthdayGiftNegative": "No offense, but your birthday gift instincts are as bad as my ex's.$s",
    "UGDE.Leah_BirthdayGiftNegative_10Hearts": "Urgh... You couldn't have known, but that was the last birthday gift Kel gave me before we broke up.$s#$e#Yes, it was one of the reasons why.$s#$b#Ah well, I refuse to let that ruin my birthday! You'll do better next year, @.",

    //Leo
    "UGDE.Leo_(O)395": "What is this? Drink of 'beans'? *sluuurp*#$b#...uh-oh. $2#$e#>F-f-f-fly!! M-m-must f-f-fly f-f-fly f-f-fly!!!$2",
    "UGDE.Leo_(O)253": "This smells too bitter. *blech*$s",
    "UGDE.Leo_(O)444": "Oh, pretty feather! It's like my parrot ones...$h#$e#'Duck'? Is that parrot name where you're from?",
    "UGDE.Leo_AcceptBirthdayGift_Positive": "A special day for a gift! I have eaten 400 golden walnuts more.$h#$b#And this is nice!$h",
    "UGDE.Leo_AcceptBirthdayGift_Negative": "A special day for a gift! I have eaten 400 golden walnuts more.$h#$b#...Oh... this is bad.$s",

    //Leo at Mainland
    "UGDE.LeoMainland_(TR)ParrotEgg": "This is a precious egg... A baby! I'm glad you brought it to me, I'll keep it safe.", //!!! This is a vanilla line, present in Leo but missing from LeoMainland. If you are translating to a vanilla supported language, this line's translation already exists in the Characters/Dialogue/Leo_{your language here}.json file from the base game.
    "UGDE.LeoMainland_(O)395": "What's this? You made a drink out of beans? *sluuurp*#$b#...uh-oh. $2#$e#>I-I-I ca-a-a-an't si-i-i-it sti-i-i-i-ill...!!!$2",
    "UGDE.LeoMainland_(O)253": "This smells too bitter. I don't want that.$s",
    "UGDE.LeoMainland_(O)444": "Oh, what a pretty feather! It's like my parrot ones...$h#$e#A 'duck' feather? I'll ask Miss Penny about it!$h",
    "UGDE.LeoMainland_Spring26": "According to the parrots, today is the anniversary of the day I washed ashore on Ginger Island... It's a bit like a birthday, right?",
    "UGDE.LeoMainland_AcceptBirthdayGift_Positive": "Thank you so much! This really helps make today feel special.$h",
    "UGDE.LeoMainland_AcceptBirthdayGift_Negative": "I thought birthday gifts were supposed to be good... Did I misunderstand? Human culture is confusing...$s",

    //Lewis
    "UGDE.Lewis_Loved_category_cooking": "You truly do take after your grandfather... He too knew how to befriend my stomach! Thank you, @!$h",

    //Linus
    "UGDE.Linus_DesertForage": "Did you bring this back all the way from the desert just for me? Thank you!$h",
    "UGDE.Linus_flowers_and_decoration": "Thank you! This will liven up my tent a little bit.$h", //Flowers, Holly and Daffodil.

    //Marnie
    "UGDE.Marnie_(O)221_1": "Oh my, what's the occasion? I don't remember ordering a cake... Thank you, @!$h",
    "UGDE.Marnie_(O)221_2": "This is also Jas's favorite, you know. I'll make sure to share some with her.",
    "UGDE.Marnie_category_egg": "Happy to see your chickens are doing just fine!",
    "UGDE.Marnie_(O)442": "Ah, a little duckling could come out of that one! Thank you.",
    "UGDE.Marnie_(O)305": "Erm... Is one of your hens sick, @? Do you want me to take a look at her?$s",
    "UGDE.Marnie_(O)289": "What a monster of an egg! I don't think this will fit in an incubator...$h",
    "UGDE.Marnie_CT_DinoOnFarm": "What!? You hatched a *dinosaur*!?$4#$b#You are one exceptional rancher, @, you know that?$h", //I know, this line isn't triggered by a gift... sue me
    "UGDE.Marnie_(O)807": "Hmm... That grassy smell... Maybe I can do something unique out of this. Thanks!$h",
    "UGDE.Marnie_(O)446": "So you're getting these too? I have no idea where they come from, since none of my rabbits seem to be missing a limb... Thank you.",
    "UGDE.Marnie_(O)107_DinoOnFarm": "I don't think I want to ranch dinosaurs. Sorry, @.$s",
    "UGDE.Marnie_(O)107_DinoNotHatched": "What kind of egg is this...? Is it worth incubating...? Keep it, @. You're the one who found it.$s",


    //Maru
    "UGDE.Maru_(O)725": "Resin! An excellent natural sealant and adhesive. Really useful for building all kinds of gadgets. Thanks!$h",
    "UGDE.Maru_(O)726": "This is perfect for an outdoorsy project I've been tinkering with! Thanks!$h#$e#Pine Tar is perfectly suited to protecting wood from all kinds of mold and insects. Very useful for fine machinery!",
    "UGDE.Maru_(O)233_1": "Thank for the ice cream! That's sweet of you.$h",
    "UGDE.Maru_(O)233_2": "I don't think you could find a bigger fan of ice cream than my Dad around here.$h",
    "UGDE.Maru_(O)233_3": "Dr. Harvey likes to watch his sugar intake, though.",

    //Pam
    "UGDE.Pam_(O)167": "Now all I need is a pirate to gift me the other half. Thanks, kid.",
    "UGDE.Pam_(O)346_InSaloon": "Buying me a round? That's sweet of you, kid! *gulp gulp*$h",
    "UGDE.Pam_(O)346_Elsewhere": "Now that's speaking my language, kid. Thanks!$h",
    "UGDE.Pam_(O)459": "It's no ambrosia, but it's gotta taste just as sweet, right? You spoil me, kid!$h",
    "UGDE.Pam_(O)303": "Doing me a solid, kid. Now come to mama, you!$h",
    "UGDE.Pam_(O)873": "*siiip* Now that tastes tropical! $h",
    "UGDE.Pam_(O)348": "A whole wine bottle!? You're not trying to put me in your debt, are you?$3#$b#You're not? ...Sorry, kid. I'm used to people this nice expecting something in return. Thanks.$0#$e#Let's both forget that happened, alright?$0",
    "UGDE.Pam_(O)24_PennySingle": "Now that looks delicious, kid! I'll ask Penny to cook it tonight. Thanks.$h#$b#What?",
    "UGDE.Pam_(O)24_PennyMarried": "Now that looks delicious, kid! Guess I'll try cooking tonight. Thanks.$h#$b#It's hard without Penny around, but... If she's happy on the farm, I'm happy.",
    "UGDE.Pam_(O)199": "Smells like it warms the heart, just the way I like it... Thank you, kid. I'm eating healthy today.$h",
    "UGDE.Pam_(O)90_Trailer": "If there was room in the trailer, I'd probably grow one of these in a pot...$h#$b#The fruit is delicious and the plant is low maintenance. Even someone like me could do it, right?$h#$b#Anyway... Thanks for listening to an older lady's ramblings.",
    "UGDE.Pam_(O)90_House": "Hmm... Well, maybe now's the time to revisit an old idea.$h#$e#I should ask Granny Mullner if she has a pot to lend next time she comes to water my plants...#$b#She'd probably be delighted.",


    //Penny
    "UGDE.Penny_(O)60": "This is my favorite gem! It's the same color as my eyes. Thanks.$h",
    "UGDE.Penny_alcohol_item": "I'm going to dump this in the nearest sink.$s",
    "UGDE.Penny_(O)398": "All I can smell is wine...$s",
    "UGDE.Penny_(O)304": "All I can smell is ale...$s",
    "UGDE.Penny_(O)446_1": "Why would you do this to a poor bunny!?$s",
    "UGDE.Penny_(O)446_2": "What do you mean they just shed limbs? That's the worst attempt at a lie I've ever heard.$a",

    //Pierre
    "UGDE.Pierre_(O)202": "*munch munch* Yum! Delicious! Tastes just like my wife's...$h#$b# Did she give you the recipe? Please, keep them coming!$h",
    "UGDE.Pierre_BirthdayGiftPositive": "What a nice birthday gift! You know how to pick 'em, @.$h#$e#I suppose you'll want me to return the favor... When's your birthday, anyway?#$b#Uh... Wait, *when* is that?$4",
    "UGDE.Pierre_BirthdayGiftNegative": "Honestly, just get me a gift card next year.$s#$e#Forget the gift card even, just give me money! That can't ever go wrong!$h",

    //Robin
    "UGDE.Robin_(O)224": "Oh, this tomato sauce is just divine! Did you make this yourself, or buy it at the saloon? I'm fine with either, honestly! Thank you @!$h",
    "UGDE.Robin_(O)709": "Mahogany has such a premium feel to it... I can never have enough! Thanks, @!$h#$e#Speaking of, my desk is made of mahogany! That makes it nigh indestructible.", //You will never take me alive

    //Sam
    "UGDE.Sam_(O)90": "Aw yeah, you brought me back a prickly pear? You're the best, @!",
    "UGDE.Sam_Mayo": "No... Not again... Noooo!!!$8",

    //Sandy
    "UGDE.Sandy_(O)88": "You braved the heat outside to bring me this? Thanks! Coconut milk is just delicious!$h",
    "UGDE.Sandy_(O)90": "Thank you! It's just what I need on a hot day like this.#$e#I know I could find some right outside, but I prefer to stay here, where the air conditioner is.",

    //Sebastian
    "UGDE.Sebastian_(O)84": "A frozen tear... That sounds so poetic. What kind of tragedy is preserved inside?$h",
    "UGDE.Sebastian_category_artisan_goods": "I'm not a \"loves cooking\" kind of person.",
    "UGDE.Sebastian_artisan_goods_not_food": "This is just going to gather dust somewhere...",
    "UGDE.Sebastian_category_egg": "Eggs... People must be joking when they say they like eggs, right? This is awful.",
    "UGDE.Sebastian_Coffee&Tea": "Thanks. I was feeling a little drowsy.",
    "UGDE.Sebastian_(O)253": "Thanks. I was feeling a little drowsy.#$b#*siip* Woah! That packs more of a punch than I expected.$0",
    "UGDE.Sebastian_Mayo": "*urp* *gag* Sorry, just... remembering something.#$e#Piece of advice: never get on the wrong side of an Abigail prank.",

    //Shane
    "UGDE.Shane_(O)206": "I could never get tired of pizza! Thanks.",
    "UGDE.Shane_(O)Alcohol_Item_Above6hearts": "Sorry @, I'm trying to quit.$0",
    "UGDE.Shane_(O)346_Under6Hearts": "Ah, I was just craving a good beer! Perfect, thanks!$h",
    "UGDE.Shane_(O)459_Under6Hearts": "Pretty neat how many things we've learned to turn into alcohol. Thanks.",
    "UGDE.Shane_(O)873_Under6Hearts": "Coconut, pineapple and rum, you can't get more Ginger Island than that. Unless you wanted to put ginger in there, I guess.",
    "UGDE.Shane_(O)348_Under6Hearts": "Don't worry about getting me a fancy glass, I can drink from the bottle. Thanks for the wine.",
    "UGDE.Shane_(O)303_Under6Hearts_1": "I prefer regular beer, but I guess that'll mix things up a bit. Thanks.",
    "UGDE.Shane_(O)303_Under6Hearts_2": "Pam is always talking Gus's ear off about adding pale ale to the taps at the saloon. It's annoying, frankly.",

    //Vincent
    "UGDE.Vincent_Cake": "Wow, it's so big! I don't have to share, do I?$h#$b#Well it's *my* cake, so *I* get to choose what I do with it.",
    "UGDE.Vincent_(O)398_1": "I love grapes! They're the best fruit ever! Thanks, mister farmer!^I love grapes! They're the best fruit ever! Thanks, miss farmer!",
    "UGDE.Vincent_(O)398_2": "Dad and I, we always go collect grapes together in Summer...#$b#Last year, I tried to give one to miss Penny.#$b#She made the same face as that time I found a cool slug on the way to class.$h",
    "UGDE.Vincent_Raisins": "What happened to those grapes? They're so tiny. *chew chew*$0#$b#...*ptooey*$s#$e#%Vincent looks so disappointed he might cry.",
    "UGDE.Vincent_category_artisan_goods": "That's for grownups.$s",

    //Willy
    "UGDE.Willy_EasyFish": "Well done! Catch a few more of these and we might have a meal.",
    "UGDE.Willy_MediumFish": "Well caught, lad. Keep at it!^Well caught, miss. Keep at it!",
    "UGDE.Willy_HardFish": "A mighty fine catch if I do say so meself! Looks like you've got the hang of that rod o' yours.$h",
    "UGDE.Willy_VeryHardFish": "What a beast... And yer giving this to me? Thanks, lad. I'll try smokin' it and see how it tastes.^What a beast... And yer giving this to me? Thanks, miss. I'll try smokin' it and see how it tastes.",
    "UGDE.Willy_(O)143": "Me first ever catch was one o' these! T'was beginner's luck, but it inspired me to follow in my Pappy's footsteps...$h#$e#*sniff* And now ye got this ol' sailor reminiscin'...",

    //Wizard
    "UGDE.Wizard_(O)155": "Ah, the humble Super Cucumber. One of the few magically enhanced creatures roaming this land...#$e#The lining of its stomach makes for an excellent potion canteen once tanned. I thank you.",
    "UGDE.Wizard_(O)422": "A purple mushroom in excellent condition! Put it on the shelf near the others. I never have enough.$h#$e#If you have ever given one a taste, you might have noticed its incredible potency.#$b#I believe this species is a variant of the more poisonous red mushroom, enhanced by root network contact with a Stardrop tree grove.#$e#Though where that grove is, this knowledge eludes even me...",
    "UGDE.Wizard_Book_Mystery": "*flip flip flip* ...A tome of esoteric knowledge. This will be of great help!$h#$e#...#$b#So, he has taken an interest in you next? Surprisingly unsurprising.#$b#I will at least say this: he has good taste in hats.",

    //Diverse SV changes, credit to AirynS
    "UGDE.Elliott_(O)705.DSV": "A beautiful albacore! Visualize it grilled over a campfire... Tonight, I shall enjoy an oceanic feast!$h#$e#I wouldn't be living on the beach if I didn't enjoy seafood.", //replaces lobster line
    "UGDE.Kent_category_cooking.DSV": "This isn't as good as my wife's meals, but it's close. Thanks.$h#$e#Never trust a man whose favorite food isn't their spouse's cooking. Tip from a husband.", //changes 'soldier' to 'husband'
    "UGDE.Kent_(O)607_3.DSV": "That meticulous attitude ended up saving my life over in Gotoro...$2#$b#Don't tell Jodi I said that.$0", //replaces 'on the battlefield' to 'over in Gotoro'
    "UGDE.Leah_(O)350.DSV": "Oh, this look great! Did you make that on your farm?$h#$e#I like to unwind with a glass of juice at the end of a fruitful day... ha! Fruitful. That pun wasn't on purpose.$h", //replaces wine line
}