{
  //Original French translation by Caranud on NexusMods!
  //Made with the help of Internationalization https://www.nexusmods.com/stardewvalley/mods/21317 by bcmpinc
  //Last updated for UGDE 1.1.2.
  //Contributions and pull requests welcome on Github https://github.com/PrincessFelicie/Unique-Gift-Dialogues-Expanded
  //Other translations exist on NexusMods also!
  "Config.Shane_AlcoholLines_Toggle.name": "Activer/désactiver les répliques \\nde Shane liées à l’alcool",
  "Config.Shane_AlcoholLines_Toggle.description": "Si désactivé, supprime les répliques liées à l'offre d'alcool à Shane.\nPrincipalement pour la compatibilité avec les mods qui modifient plus en profondeur les goûts de Shane.",
  "UGDE.Abigail_Mayo1": "Hé, un pot de mayo ! Cul sec ! Je plaisante… Ou pas ?",
  "UGDE.Abigail_Mayo2": "J'ai mangé de la mayo directement du pot une fois pour piéger ma mère... Je ne pense pas qu'elle s'en soit jamais remise !",
  "UGDE.Abigail_Mayo3": "Puis je l'ai refait avec Sam et Sebastian. De bons moments. #$b#Alors, qui devrais-je effrayer ensuite ?",
  "UGDE.Abigail_(O)128": "Woah, ce poisson a l'air tellement bizarre ! J'adore !",
  "UGDE.Abigail_(O)276_LateFall": "La meilleure chose à propos des citrouilles, c'est que rien ne se perd. L'intérieur est délicieux et l'extérieur fait une lanterne géniale ! Merci !",
  "UGDE.Abigail_(O)276_NotFall": "Ça a l'air appétissant... Merci, @ !",
  "UGDE.Alex_(O)306": "Protéines et calories, les fondements des champions ! Merci, @ ! $h#$e#Alors... On s'y met ! *gloups* *mâche* *mâche* *gloups*! C'est un nouveau record !$h",
  "UGDE.Alex_BirthdayGiftLiked": "Un cadeau d'anniversaire ? Merci @ ! C'est plutôt cool.",
  "UGDE.Alex_BirthdayGiftNeutral": "C'est pour mon anniversaire, non ? Merci !",
  "UGDE.Caroline_(O)213": "Ah, un taco au thon ! Comment savais-tu que j'adore ça ? Merci, @ !$h#$e# Willy vend son propre poisson, donc il est rare que nous en ayons en magasin. Je n'ai pas l'occasion de les faire aussi souvent que je le voudrais...",
  "UGDE.Caroline_Mayo1": "Ah... Désolée, c'est juste... Je ne peux pas regarder la mayonnaise de la même manière depuis qu’Abigail…$s",
  "UGDE.Caroline_Mayo2": "Je peux toujours cuisiner avec, mais voir un pot frais et non ouvert me donne des frissons. Je dois demander à Pierre de les ouvrir pour moi…",
  "UGDE.Caroline_(O)276_LateFall": "Est-ce pour la Fête des esprits ? Je vais demander à Abigail de m'aider à la sculpter… Merci.",
  "UGDE.Caroline_(O)276_NotFall": "Ah ! Ma fille adore les citrouilles. Il semble que je vais faire de la soupe ce soir ! Merci, @.",
  "UGDE.Clint_category_gem": "Hein. Une pierre de qualité. Tu as l'œil pour l'extraction minière, @.",
  "UGDE.Clint_(O)60": "C'est une jolie émeraude. Je pourrais en faire une belle bague... Tu sécurises mes profits pour cette semaine avec ça, @. Merci !$h#$e#La guilde des aventuriers me commande régulièrement des anneaux, si vous vous demandiez d'où ils venaient. Est-ce qu'ils servent à quelque chose ?",
  "UGDE.Clint_(O)62": "Une aigue-marine ! Tu sais, malgré le nom, la seule chose qu'ils ont en commun avec la mer, c'est la couleur. Merci, @.$h",
  "UGDE.Clint_(O)64": "Hmm… Oui, c'est un rubis authentique ! Joli et précieux ! Merci, @ !",
  "UGDE.Clint_(O)66": "Tu me donnes juste une améthyste ? … Merci, @.$h#$e# J'aime travailler avec les améthystes, c'est un défi plaisant de les façonner. Ni trop durs, ni trop faciles.",
  "UGDE.Clint_(O)68": "Un topaze ! Le pain et le beurre de la gemmologie. Ça va sûrement se vendre rapidement. Merci ! $h#$e# Je sais que le terme approprié est la bijouterie, mais « gemmologie» sonne mieux, n'est-ce pas ?",
  "UGDE.Clint_(O)70": "Ah, un morceau de jade ! C'est une des gemmes favories des mineurs, ce qui signifie une vente facile pour moi, héhé !$h#$e#J'ai entendu parler de ces nouveaux crystalariums... Apparemment, les jades sont l'une des gemmes les plus dupliquées. Fais attention à ce que ces machines ne te mettent pas au chômage, @.",
  "UGDE.Clint_(O)72": "Un diamant !? Oh là là... Ne te méprens pas, je suis reconnaissant, ils sont juste… si difficiles à travailler… Merci, @.$s",
  "UGDE.Clint_(O)74": "Est-ce un éclat prismatique !? Je n'aurais jamais pensé en voir un de si près… ! Je ne sais pas quoi dire, merci @!$h#$e# J'aimerais pouvoir vous donner un petit quelque chose en échange, mais ils sont vraiment si rares. Je ne sais même pas ce que je vais en faire !",
  "UGDE.Clint_(O)Book_Friendship": "Que veut dire cela ? C’est rude.$a#$b#Attends... Est-ce que tu veux juste voir ma réaction ? … D'accord, j’interprète peut-être trop. Peut-être que cela pourra m'aider avec… Peu importe. Merci, @.\",",
  "UGDE.Clint_furnace_item": "Tu as une bonne maîtrise de tes fours ! J'accueille toujours avec plaisir plus de matières premières à travailler !",
  "UGDE.Clint_(O)910": "Qu'est-ce qui ne va pas chez toi !? Essaies-tu de nous irradier tous à mort !? Sors ça immédiatement de ma forge !",
  "UGDE.Clint_(O)338": "Je peux trouver une utilité ou deux pour ça. Merci.#$e#Le quartz a de nombreuses propriétés intéressantes qui le rendent très polyvalent, mais il est assez abordable. Néanmoins, un cadeau reste un cadeau.",
  "UGDE.Demetrius_(O)207": "Une source saine de glucides et délicieuse en plus ! Qu'y a-t-il à ne pas aimer ? Merci !$h#$e#Pour être honnête, mes plats favoris sont tous des desserts…",
  "UGDE.Demetrius_(O)233": "Comme c'est merveilleux ! Je devrais probablement dévorer ça avant que ça ne fonde. glouglou glouglou#$e#C'est bon pour la santé de laisser parfois parler son enfant intérieur. Pour moi, la crème glacée le fait sans faille.",
  "UGDE.Demetrius_(O)232": "Un riz au lait maison ! J'adore la texture crémeuse et moelleuse de ce dessert.#$e#D'après ce que j'ai observé, la plupart des gens ne se soucient que du goût de leur nourriture, mais la texture est tout aussi importante pour moi.",
  "UGDE.Demetrius_(O)400_1": "As-tu cultivé ça sur ta ferme ? Ils ont l'air mûrs et délicieux !$h",
  "UGDE.Demetrius_(O)400_2": "La composition minérale de la vallée est particulièrement propice à la croissance des fraises. Maru les aime autant que moi.",
  "UGDE.Dwarf_(O)554": "Oh ho ! C'est rare d’en avoir !#$e#Si vous vous demandez à quoi ça pourrait ressembler pour toi… Je suppose que ces objets seraient similaires à vos \"fromages\" humains, pour nous.",
  "UGDE.Dwarf_(O)121": "Cela semble… usé. Un autre vestige de mes ancêtres, très probablement. Merci, humain.",
  "UGDE.Dwarf_(O)122": "J'aimerais savoir comment utiliser ça. C'est certainement l'un des nôtres qui l’a fabriqué…#$e#J'ai entendu dire qu'il y a une gigantesque machine naine toujours fonctionnelle sur une île au sud de là… J'espère pouvoir aller la voir un jour.",
  "UGDE.Dwarf_ScrollIntro": "Hmm... Ce dialecte est assez désuet, je ne pense pas que vous pourriez le lire même si vous essayiez.#$b#Ce parchemin fait partie d'une série qui détaille l'ancienne histoire de notre peuple.",
  "UGDE.Dwarf_Scroll1_1st": "Il décrit à quoi ressemblait notre vie, lorsque notre civilisation était à son apogée.#$b#Notre technologie était sans égale… mais je suppose que vous le saviez déjà.",
  "UGDE.Dwarf_Scroll1_nth": "Ce parchemin décrit à quoi ressemblait notre vie, lorsque notre civilisation était à son apogée.#$b#Notre technologie était sans égale… mais je suppose que vous le saviez déjà.",
  "UGDE.Dwarf_Scroll2_1st": "Il raconte une catastrophe, celle qui menaçait de mettre fin à la race naine.#$b#D'après ce qu’il y  a écrit… Hmm. Ça aurait pu être n'importe quoi, d'une éruption volcanique à un astéroïde.#$b#Ça pourrait même être métaphorique… Le manque de clarté me frustre.",
  "UGDE.Dwarf_Scroll2_nth": "Ce parchemin raconte une catastrophe, une qui menaçait de mettre fin à la race naine.#$b#D'après ce qu’il y  a écrit… Hmm. Ça aurait pu être n'importe quoi, d'une éruption volcanique à un astéroïde.#$b#Ça pourrait même être métaphorique… Le manque de clarté me frustre",
  "UGDE.Dwarf_Scroll3_1st": "Il explique que nos ancêtres ont construit un vaisseau massif capable de transporter des millions de personnes.#$b#Ils cherchaient à ne laisser personne derrière, mais le temps était contre eux.#$b#Finalement, ils sont partis, entamant un long voyage à la recherche d'un nouveau foyer.",
  "UGDE.Dwarf_Scroll3_nth": "Ce parchemin explique que nos ancêtres ont construit un vaisseau massif capable de transporter des millions de personnes.#$b#Ils cherchaient à ne laisser personne derrière, mais le temps était contre eux.#$b#Finalement, ils sont partis, entamant un long voyage à la recherche d'un nouveau foyer.",
  "UGDE.Dwarf_Scroll4_1st": "Il dit que le voyage de notre peuple s'est terminé plutôt abruptement.#$b#Ils n'avaient pas l'intention de s'installer sur une terre déjà habitée, mais leur vaisseau a été irrémédiablement endommagé lors de l'atterrissage.#$b#La plupart de nos archives ont été perdues dans le crash... La tradition orale n'a pu en préserver qu'une partie.#$b#Sans autre choix, notre peuple s'est installé sous terre, reconstruisant nos vies à neuf.",
  "UGDE.Dwarf_Scroll4_nth": "Ce parchemin dit que le voyage de notre peuple s'est terminé plutôt abruptement.#$b#Ils n'avaient pas l'intention de s'installer sur une terre déjà habitée, mais leur vaisseau a été irrémédiablement endommagé lors de l'atterrissage.#$b#La plupart de nos archives ont été perdues dans le crash... La tradition orale n'a pu en préserver qu'une partie.#$b#Sans autre choix, notre peuple s'est installé sous terre, reconstruisant nos vies à neuf.",
  "UGDE.Dwarf_(O)78_Tuesday": "Tu m'as entendu marmonner plus tôt, je vois... Tu en as ramené un juste pour moi ? C'est très gentil, humain.",
  "UGDE.Dwarf_(O)78_NotTuesday": "Une carotte de cave ! Je pourrais en manger tous les jours. Merci.",
  "UGDE.Dwarf_Carrot": "Est-ce une carotte de surface ? Je ne m'attendais pas à ce qu'elle soit si... orange.",
  "UGDE.Elliott_(O)715": "Un magnifique homard ! Imagine-le grillé sur un feu de camp... Ce soir, je vais savourer un festin de crustacés !#$h#$e#Je ne vivrais pas sur la plage si je n'aimais pas les fruits de mer",
  "UGDE.Elliott_(O)705.DSV": "A beautiful albacore! Visualize it grilled over a campfire... Tonight, I shall enjoy an oceanic feast!$h#$e#I wouldn't be living on the beach if I didn't enjoy seafood.", //new
  "UGDE.EmilyBlessingName": "Bénédiction d’Émilie",
  "UGDE.Emily_(O)72": "Le sens-tu ? La pure énergie divine émanant de cette gemme ? C'est tellement merveilleux...#$h#$e#Que Yoba te bénisse en cette belle journée.$7",
  "UGDE.Emily_(O)74": "Comme c'est merveilleux... Un cocktail d'énergie positive, qui circule tout autour de nous ! C'est donc le pouvoir d'une Éclat prismatique...#$h#$e#Cela éclairera considérablement l'ambiance de notre salon !#$h",
  "UGDE.Emily_(O)634_Early": "Oh ! Je ne m'attendais pas à ce que %farm Farm cultive déjà des arbres fruitiers. Ou est-ce un cadeau d'un ami de la forêt ? Merci !#$h#$e#J'aime vraiment le goût de l'abricot en cette période de l'année, mais Pierre a généralement ce qu'il me faut.",
  "UGDE.Emily_(O)634_AfterQuest": "Comme c'est gentil de ta part, un autre abricot ! Ton attention pour les gens qui t'entourent transparaît à travers ce cadeau.$h",
  "UGDE.Evelyn_(O)20_Early": "Merci, mon petit. Donne ça à George la prochaine fois, je sais qu'il l'apprécierait beaucoup.",
  "UGDE.Evelyn_(O)20_AfterSpecial": "C'était tellement gentil de ta part de m'aider avec le cadeau surprise de George. Je veillerai à ce qu'il le reçoive aussi.",
  "UGDE.Evelyn_category_flowers": "Ah, qu'est-ce que ça sent bon… ! Je vais trouver un vase assorti pour le mettre dedans. Merci, mon petit.$h",
  "UGDE.Evelyn_(O)595": "Oh là là, je ne serais pas contre une petite visite d'une fée amicale ! Peut-être que ce sera exactement ce dont j'ai besoin pour en inviter une à prendre le thé...#$h#$e#J'en ai vu une près de ta ferme une fois, quand j'étais beaucoup plus jeune. Bien sûr, c'était celle de ton grand-père à l'époque…",
  "UGDE.Evelyn_Raisins_1": "Ces raisins sont délicieux, mon cher ! Les bons vieux raisins de %farm Farm… Le goût m'avait tellement manqué.$h",
  "UGDE.Evelyn_Raisins_2": "Ton grand-père en faisait tellement avant chaque récolte, plus que je ne pouvais jamais lui acheter.#$b#Je ne devais pas être la seule amatrice de raisins dans la Vallée... *clin d'œil*",
  "UDGE.Evelyn_BirthdayGiftPositive": "Oh, c'est très gentil de ta part, cher ! Même après toutes ces années, mon anniversaire reste spécial.",
  "UDGE.Evelyn_BirthdayGiftNegative": "Oh... Est-ce un cadeau d'anniversaire ? Que Yoda te bénisse, mon petit.",
  "UGDE.George_(O)20": "*sniff sniff* Cette odeur incroyable... Est-ce qu'elle t'a mise dans le coup ? Bah, c'est génial de toute façon !$h",
  "UGDE.George_(O)205": "Ça me rappelle le bon vieux temps... Tu sais comment rendre un vieux homme heureux. J'ai mangé comme il faut de ces choses à l'époque !$h#$e#Ma femme ne fait plus de friture de nos jours... Elle dit que c'est mauvais pour mon cœur.#$b#Mais je partirai comme je veux si ça signifie partir avec le sourire !$h",
  "UGDE.George_(O)260_Early": "Hmm ? *grognement* #$e#Je ne pense pas en avoir besoin, pas vrai ? Bah, je suis sûr d'en avoir assez.$2#$b#Hey, est-ce qu'un vieil homme peut marmonner tout seul en paix ? Va-t'en.$3",
  "UGDE.George_(O)260_AfterQuest": "Mon genou va bien aujourd'hui, mais merci. Je vais le garder pour un autre jour.#$b#Yoba sait que ce truc réagit comme bon lui semble.",
  "UGDE.George_(O)284": "Une betterave...#$b#...#$b#C'est le plat préféré d'Evelyn. Mais tu ne l'as pas entendu venant de moi, d'accord ?",
  "UDGE.George_BirthdayGiftPositive": "Encore une année, encore un pas de plus vers la tombe...$2#$b#Hmm ? Un cadeau d'anniversaire ? Bien sûr.$0",
  "UDGE.George_BirthdayGiftNegative": "Encore une année, encore un pas de plus vers la tombe...$2#$b#Hmm ? Un cadeau d'anniversaire ?$0#$b#...Yoba, si tu existes, contente-toi de m’emporter plutôt.$3",
  "UGDE.Gus_(O)72": "Ah ! Donc tu as remarqué que l'œil de la statue de l'ours manquait ? Ça fera un remplacement parfait, @ !$h",
  "UGDE.Gus_(O)265_1": "Comment l'odeur peut-elle avoir un goût d'encre...?$s",
  "UGDE.Gus_(O)265_2": "Je ne suis pas sûr comment Willy peut manger ce truc, mais il attend avec impatience les méduses lumineuses chaque année grâce à ça.",
  "UGDE.Gus_(O)203_1": "Ah... ma pire erreur. J'espérais que la recette n'avait pas été diffusée...$s",
  "UGDE.Gus_(O)203_2": "De temps en temps, j'en ai en stock à la demande de Shane, mais même lui m'a dit que c'était \"juste correct\".#$b#Ne demande pas d'où vient la mayonnaise.$s",
  "UGDE.Gus_(O)729": "La présentation pourrait être améliorée, mais... ah. Sans prétention, mais cela reste délicieux. 'Bon appétit' !$h",
  "UGDE.Gus_(O)648": "Pourquoi faire ça à un chou parfaitement délicieux…",
  "UGDE.Gus_(O)213_1": "Voilà une utilisation appropriée d'un chou rouge ! Le thon aide vraiment à tout rassembler. Merci !",
  "UGDE.Gus_(O)213_2": "Je ne recommanderais pas d'en offrir un à Emily. Ça pourrait être une allergie au poisson ? Je ne suis pas sûr...#$b#Je l'ai vue faire la moue devant plus d'un plat à base de poisson.",
  "UGDE.Haley_(O)221_early": "Est-ce le célèbre gâteau rose de la Reine des Sauces ? J'en meurs d'envie depuis si longtemps ! Merci !#$h#$e#J'ai envoyé une lettre à l'émission pour demander la recette, mais ils doivent être débordés..",
  "UGDE.Haley_(O)221_year2NoRecipe": "Est-ce le célèbre gâteau rose de la Reine des Sauces ? Donc, tu as aussi regardé l'épisode !#$h#$e#Quoi ? ...Non ? Eh bien, tu as de la chance, je l'ai enregistré ! Tiens.#$b#%Tu as appris la recette du Gâteau Rose !",
  "UGDE.Haley_(O)221_year2RecipeKnown": "Ah... Qui aurait deviné que cette saveur incroyable était celle du melon ? Les recettes de la Reine des Sauces sont toujours délicieuses. #$h#$b#As-tu vu le moment où elle a lu ma lettre ?",
  "UGDE.Haley_BirthdayGiftNeutral": "Est-ce pour mon anniversaire ? C'est plutôt bien, je suppose. Merci pour le cadeau.",
  "UGDE.Harvey_(O)395": "Je ne peux pas commencer la journée sans une tasse de café... Ah, et celle-ci sent fantastiquement bon !#$h#$e#Je bois habituellement mon café noir, mais je ne suis pas contre ajouter du lait non plus. #$b#C'est une source bien connue de calcium.",
  "UGDE.Harvey_BeachForage": "Ah non ! Je suis certainement allergique à ÇA ! $2",
  "UGDE.Harvey_(O)152": "Une algue… ? … Pourquoi ?",
  "UGDE.Jas_Cake_1": "J'espère que ce gâteau est aussi délicieux qu'il est joli ! Je l'adore ! *rire* $h",
  "UGDE.Jas_Cake_2a": "Je me demande si je devrais partager avec Vincent et Miss Penny... Le gâteau est assez gros.$u",
  "UGDE.Jas_Cake_2b": "Je me demande si je devrais partager avec Shane et Tante Marnie... Le gâteau est assez gros.$u",
  "UGDE.Jas_category_artisan_goods": "Je ne pense pas que ce soit aropr... approrpri... bon pour mon âge.",
  "UGDE.Jodi_category_cooking": "Tu tentes la cuisine ? Peut-être que toi, Gus et moi devrions échanger des recettes...#$h#$e#Il n'y a pas de meilleur moyen d'avoir un gros livre de recettes que de se lier d'amitié avec les gens, si tu veux mon avis.#$b# Tout le monde a une ou deux recettes qu'ils partagent avec des amis !#$h",
  "UGDE.Jodi_(O)265": "Non merci.",
  "UGDE.Jodi_(O)203": "N'est-ce pas celui de Gus...?#$4#$b#Oh, c'est ça. Berk...#$s#$e#Tous les essais ne donnent pas de bons résultats, disons...",
  "UGDE.Jodi_(O)190_Early": "Un chou-fleur ! Hmm... Tu m'as donné quelques idées. Merci. #$e#Je vais expérimenter quelques plats avec celui-ci... Si tout se passe bien, je pourrais t’en redemander bientôt, d'accord ?",
  "UGDE.Jodi_(O)190_AfterQuest": "Un autre chou-fleur ! Merci. #$e#Il est difficile de faire manger des légumes à Vincent, mais le curry jaune fonctionne toujours…",
  "UGDE.Kent_category_cooking": "\"Ce n'est pas aussi bon que les repas de ma femme, mais c'est proche. Merci. #$h#$e#Ne faites jamais confiance à un homme dont la nourriture préférée n'est pas la cuisine de son épouse. Conseil d'un soldat.",
  "UGDE.Kent_category_cooking.DSV": "This isn't as good as my wife's meals, but it's close. Thanks.$h#$e#Never trust a man whose favorite food isn't their spouse's cooking. Tip from a husband.", //new
  "UGDE.Kent_(O)607_1": "Cela me rappelle de bons souvenirs... Merci. #$h",
  "UGDE.Kent_(O)607_2": "Je faisais ça moi-même quand j'étais enfant, en jouant dans la forêt. #$h#$b#Je démarrais un feu de camp comme on m'avait appris et je les grillais sur une flamme ouverte. #$h#$b#Je prenais la sécurité incendie très au sérieux et je vérifiais toujours trois fois que j'avais bien éteint le feu.$5",
  "UGDE.Kent_(O)607_3": "Cette attitude méticuleuse a fini par me sauver la vie sur le champ de bataille...#$2#$b#Ne répète pas à Jodi que je t'ai dit.",
  "UGDE.Kent_(O)607_3.DSV": "That meticulous attitude ended up saving my life over in Gotoro...$2#$b#Don't tell Jodi I said that.$0", //new
  "UGDE.Krobus_(O)203": "Puis-je... ? *mâchouille* Oh wow... Est-ce vraiment de la cuisine humaine ? Je n'ai jamais goûté quelque chose d’aussi délicieux !#$h#$e#La plupart des plats de votre peuple m'ont déçu, mais ça, c'est une exception.",
  "UGDE.Krobus_(O)265": "Ça sent un peu comme les égouts, mais... en mieux. Merci.",
  "UGDE.Krobus_(O)16": "Ça a un goût si doux et sucré ! J'adore !#$h",
  "UGDE.Leah_(O)348": "Oh, ça a l'air super ! Tu l'as fait sur ta ferme ?#$h#$e#J'aime me détendre avec un verre de vin à la fin d'une journée fructueuse... ha ! Fructueuse. Ce jeu de mots n'était pas intentionnel.$h",
  "UGDE.Leah_(O)350.DSV": "Oh, this look great! Did you make that on your farm?$h#$e#I like to unwind with a glass of juice at the end of a fruitful day... ha! Fruitful. That pun wasn't on purpose.$h", //new
  "UGDE.Leah_BirthdayGiftNegative": "Pas d’offense, mais ton instinct pour les cadeaux d'anniversaire est aussi mauvais que celui de mon ex.",
  "UGDE.Leah_BirthdayGiftNegative_10Hearts": "Urgh... Tu ne pouvais pas savoir, mais c'était la dernière chose que Kel m'a offerte pour mon anniversaire avant qu'on se sépare. #$s#$e#Oui, c'était l'une des raisons. #$s#$b#Bon eh bien, je refuse de laisser cela gâcher mon anniversaire ! Tu feras mieux l'année prochaine, @.",
  "UGDE.Leo_(O)395": "Qu'est-ce que c'est ? Tu as fait une boisson à base de \"haricots\" ? *slurp* #$b#... oh-oh. $2#$e#> V-v-o-ler ! Je d-d-dois m’env-v-o-ler...!!!$2",
  "UGDE.Leo_(O)253": "Ça sent trop amer.$s",
  "UGDE.Leo_(O)444": "Oh, quelle jolie plume ! C'est comme celles de mon perroquet...#$h#$e#Un \"canard\" ? C'est le nom du perroquet là d'où tu viens ?",
  "UGDE.LeoMainland_(TR)ParrotEgg": "\"C'est un œuf précieux… Un bébé ! Je suis content que tu me l'aies apporté, je vais le garder en sécurité.",
  "UGDE.LeoMainland_(O)395": "Qu'est-ce que c'est ? Tu as fait une boisson à base de haricots ? slurp#$b#... oh-oh. $2#$e#> V-oJe ne p-p-peux p-p-p-p-p-pas r-r-r-r-r-rester imm-m-m-m-m-m-m-m-m-mobile...!!!$2",
  "UGDE.LeoMainland_(O)253": "Ça sent trop amer. Je ne veux pas de ça.$s",
  "UGDE.LeoMainland_(O)444": "Oh, quelle jolie plume ! C'est comme celles de mon perroquet...#$h#$e#Une plume de \"canard\" ? Je demanderai à Mademoiselle Penny de m’expliquer !$h",
  "UDGE.Lewis_(O)200": "Tu ressembles vraiment à ton grand-père... Toujours un cadeau pensé avec soin en tête ! Merci, @ !$h",
  "UGDE.Linus_DesertForage": "Tu as ramené ça en faisant tout le chemin depuis le désert juste pour moi ? Merci !$h",
  "UGDE.Linus_(O)283": "Merci ! Cela va égayer un peu ma tente.$h",
  "UGDE.Marnie_(O)221_1": "Oh Yoda, quelle est l'occasion ? Je ne me souviens pas d'avoir commandé un gâteau... Merci, @ !$h",
  "UGDE.Marnie_(O)221_2": "C'est aussi le gâteau préféré de Jas, tu sais. Je vais m'assurer d'en partager avec elle.",
  "UGDE.Marnie_category_egg": "Contente de voir que tes poules se portent bien !",
  "UGDE.Marnie_(O)442": "Ah, un petit caneton pourrait sortir de celui-là ! Merci.",
  "UGDE.Marnie_(O)305": "\"Euh... Une de tes poules est malade, @ ? Veux-tu que je jette un coup d'œil ?$s",
  "UGDE.Marnie_(O)289": "Quel œuf monstrueux ! Je ne pense pas que ça rentrera dans un incubateur...#$h",
  "UGDE.Marnie_CT_DinoOnFarm": "Quoi !? Tu as fait éclore un dinosaure !?$4#$b#Tu es un éleveur exceptionnel, @, tu le sais ça ?#$h",
  "UGDE.Marnie_(O)807": "Hmm... Cette odeur d'herbe... Peut-être que je peux en faire quelque chose d'unique. Merci !#$h",
  "UGDE.Marnie_(O)446": "Alors toi aussi tu en trouves ? Je n'ai aucune idée d'où ça vient, puisque aucun de mes lapins ne semble manquer d'un de ses membres... Merci.",
  "UGDE.Marnie_(O)107_DinoOnFarm": "Je ne pense pas que je veuille élever des dinosaures. Désolée, @.$s",
  "UGDE.Marnie_(O)107_DinoNotHatched": "Quel genre d'œuf est-ce...? Est-ce qu'il vaut la peine de l'incuber… ? Garde-le, @. C'est toi qui l'a trouvé.$s",
  "UGDE.Maru_(O)725": "De la résine ! Un excellent mastic et adhésif naturel. Vraiment utile pour construire toutes sortes de gadgets. Merci !#$h",
  "UGDE.Maru_(O)726": "C'est parfait pour un projet en plein air sur lequel je bricole ! Merci !#$h#$e#La résine de pin est parfaitement adaptée pour protéger le bois de toutes sortes de moisissures et d'insectes. Très utile pour la mécanique fine !",
  "UGDE.Maru_(O)233_1": "Merci pour la glace ! C'est gentil de ta part.$h",
  "UGDE.Maru_(O)233_2": "Je ne pense pas que tu puisses trouver un plus grand fan de glace que mon père ici.$h",
  "UGDE.Maru_(O)233_3": "Le Dr. Harvey aime surveiller sa consommation de sucre, cependant.",
  "UGDE.Pam_(O)167": "Tout ce dont j'ai besoin maintenant, c'est d'un pirate pour me donner l'autre moitié. Merci, gamin.",
  "UGDE.Pam_(O)346_InSaloon": "Tu m'offres un verre ? C'est gentil de ta part, gamin ! *glou glou*",
  "UGDE.Pam_(O)346_Elsewhere": "Maintenant, ça, ça me parle, gamin. Merci !#$h",
  "UGDE.Pam_(O)459": "Ce n'est pas de l'ambroisie, mais ça doit être aussi sucré, non ? Tu me gâtes, gamin !#$h",
  "UGDE.Pam_(O)303": "Tu me rends un sacré service, gamin. Viens voir maman, toi !#$h",
  "UGDE.Pam_(O)873": "*gloup* Ça, ça a un goût tropical ! #$h",
  "UGDE.Pam_(O)348": "Une bouteille entière de vin !? Tu ne cherches pas à ce que je t’en doive une, n'est-ce pas ?#$3#$b#Non ? ... Désolée, gamin. J'ai l'habitude des gens si gentils qui attendent quelque chose en retour. Merci. #$0#$e#Oublions tous les deux que ça s'est passé, d'accord ?#$0",
  "UGDE.Pam_(O)24_PennySingle": "Ça a l'air délicieux, gamin ! Je vais demander à Penny de le cuisiner ce soir. Merci. #$h#$b#Quoi ?",
  "UGDE.Pam_(O)24_PennyMarried": "Ça a l'air délicieux, gamin ! Je vais essayer de cuisiner ce soir. Merci. #$h#$b#C'est difficile sans Penny, mais… Si elle est heureuse à la ferme, je suis heureuse.",
  "UGDE.Pam_(O)199": "Ça sent comme si ça réchauffait le cœur, exactement comme j'aime... Merci, gamin. Je mange sainement aujourd'hui. #$h",
  "UGDE.Pam_(O)90_Trailer": "S'il y avait de la place dans la caravane, je mettrais probablement un de ces trucs dans un pot...#$h#$b#Le fruit est délicieux et la plante est facile d'entretien. Même quelqu'un comme moi pourrait le faire, non ?#$h#$b#Enfin... Merci d'écouter les divagations d'une vieille dame.",
  "UGDE.Pam_(O)90_House": "Hmm... Eh bien, peut-être est-ce le moment de revisiter cette vieille idée. #$h#$e#Je devrais demander à Mamie Mullner si elle a un pot à prêter la prochaine fois qu'elle viendra arroser mes plantes...#$b#Elle serait probablement ravie.",
  "UGDE.Penny_(O)60": "C'est ma gemme préférée ! Elle est de la même couleur que mes yeux. Merci. #$h",
  "UGDE.Penny_alcohol_item": "Je vais verser ça dans le premier évier venu.$s",
  "UGDE.Penny_(O)398": "Tout ce que je sens, c'est le vin...$s",
  "UGDE.Penny_(O)304": "Tout ce que je sens, c'est la bière...$s",
  "UGDE.Penny_(O)446_1": "Pourquoi tu ferais ça à un pauvre lapin !?$s",
  "UGDE.Penny_(O)446_2": "Comment ça, ils perdent juste des membres ? C'est la pire tentative de mensonge que j'ai jamais entendue.$a",
  "UGDE.Pierre_(O)202": "*mâche* *mâche* Miam ! Délicieux ! C'est exactement le goût de ceux de ma femme...#$h#$b# T'as-t-elle donné la recette ? S'il te plaît, continue à en apporter !#$h",
  "UGDE.Pierre_BirthdayGiftNegative": "Franchement, contente-toi de me prendre une carte cadeau l'année prochaine.$s#$e#Oublie même la carte cadeau, donne-moi juste de l'argent ! Ça ne peut jamais mal tourner !#$h",
  "UGDE.Robin_(O)224": "Oh, cette sauce tomate est tout simplement divine ! L'as-tu faite toi-même, ou l'as-tu achetée au saloon ? Honnêtement, les deux me vont ! Merci @ !#$h",
  "UGDE.Robin_(O)709": "Le bois d'acajou a une sensation de qualité supérieure... Je n'en aurai jamais assez ! Merci, @ !#$h#$e#En parlant de ça, mon bureau est en acajou ! Cela le rend presque indestructible.",
  "UGDE.Sam_(O)90": "Ah ouais, tu m'as ramené une figue de barbarie ? Tu es le meilleur, @ !",
  "UGDE.Sam_Mayo": "Non… Pas encore… Nooooon !!!$8",
  "UGDE.Sandy_(O)88": "Tu as bravé la chaleur pour m'apporter ça ? Merci ! Le jus de coco est juste délicieux~$h",
  "UGDE.Sandy_(O)90": "Merci ! C'est exactement ce dont j'ai besoin par une journée chaude comme celle-ci. #$e#Je sais que je pourrais en trouver juste dehors, mais je préfère rester ici, où il y a la climatisation.",
  "UGDE.Sebastian_(O)84": "Une larme gelée... Ça sonne si poétique. Quel genre de tragédie est conservé à l'intérieur ?$h",
  "UGDE.Sebastian_category_artisan_goods": "Je ne suis pas du genre cuisinier.",
  "UGDE.Sebastian_(O)428": "Cela va juste prendre la poussière quelque part...",
  "UGDE.Sebastian_category_egg": "Des œufs... Les gens doivent plaisanter quand ils disent qu'ils aiment les œufs, non ? C'est affreux.",
  "UGDE.Sebastian_Coffee&Tea": "Merci. Je me sentais un peu endormi.",
  "UGDE.Sebastian_(O)253": "Merci. Je me sentais un peu endormi. #$b# *bois* Waouh ! Ça a plus de punch que ce que je pensais.$0",
  "UGDE.Sebastian_Mayo": "*blêmit* Désolé, je... me souviens juste de quelque chose. #$e# Un conseil : ne te mets jamais du mauvais côté d'une blague d'Abigail.",
  "UGDE.Shane_(O)206": "Je ne pourrais jamais me lasser de la pizza ! Merci.",
  "UGDE.Shane_(O)Alcohol_Item_Above6hearts": "Désolé @, j'essaie d'arrêter.$0",
  "UGDE.Shane_(O)346_Under6Hearts": "Ah, j'avais juste envie d'une bonne bière ! Parfait, merci !#$h",
  "UGDE.Shane_(O)459_Under6Hearts": "C'est plutôt cool de voir combien de choses nous avons appris à transformer en alcool. Merci.",
  "UGDE.Shane_(O)873_Under6Hearts": "Noix de coco, ananas et rhum, ça ne peut pas être plus l'Île de Gingembre que ça. À moins que tu ne veuilles mettre du gingembre dedans, je suppose.",
  "UGDE.Shane_(O)348_Under6Hearts": "Ne t'embête pas à me trouver un verre chic, je peux boire à la bouteille. Merci pour le vin.",
  "UGDE.Shane_(O)303_Under6Hearts_1": "Je préfère la bière ordinaire, mais je suppose que ça va changer un peu. Merci.",
  "UGDE.Shane_(O)303_Under6Hearts_2": "Pam passe son temps à harceler Gus pour qu'il ajoute de la bière blonde dans le stock du saloon. C'est agaçant, franchement.",
  "UGDE.Vincent_Cake": "Waouh, c'est tellement gros ! Je ne suis pas obligé de partager, n'est-ce pas ?#$h#$b#Eh bien, c'est mon gâteau, alors c'est moi qui décide ce que j'en fais.",
  "UGDE.Vincent_(O)398_1": "J'adore les raisins ! C'est le meilleur fruit du monde ! Merci, monsieur le fermier !^J'adore les raisins ! C'est le meilleur fruit du monde ! Merci, madame la fermière !",
  "UGDE.Vincent_(O)398_2": "Papa et moi, on va toujours ramasser des raisins ensemble en été...#$b#L'année dernière, j'ai essayé d'en donner un à mademoiselle Penny.#$b#Elle a fait la même tête que celle qu'elle a faite quand j'ai trouvé une limace cool en chemin pour l'école.$h",
  "UGDE.Vincent_Raisins": "Qu'est-il arrivé à ces raisins ? Ils sont si petits. *mâche mâche* $0#$b#... * erghhh* $s#$e#% Vincent a l'air tellement déçu qu'il pourrait pleurer.",
  "UGDE.Vincent_category_artisan_goods": "C'est pour les adultes, pas pour moi.$s",
  "UGDE.Willy_EasyFish": "Bien joué ! Attrape quelques-uns de plus comme ça et nous aurons peut-être un repas.",
  "UGDE.Willy_MediumFish": "Bonne pêche, mon garçon. Continue comme ça !^Bonne pêche, ma fille. Continue comme ça !",
  "UGDE.Willy_HardFish": "Une très belle prise , si j'ose dire ! On dirait que tu as compris le fonctionnement de ta canne.$h",
  "UGDE.Willy_VeryHardFish": "Quelle bête... Et tu me l'offres ? Merci, mon garçon. Je vais essayer de le fumer et voir quel goût ça a.^Quelle bête... Et tu me l'offres ? Merci, ma fille. Je vais essayer de le fumer et voir quel goût ça a.",
  "UGDE.Willy_(O)143": "Ma toute première prise était une de celles-ci ! C'était de la chance de débutant, mais cela m'a inspiré à suivre les traces de mon papa...#$h#$e#sniff Et maintenant tu te retrouves avec ce vieux marin en train de se remémorer ses souvenirs d’enfance...",
  "UGDE.Wizard_(O)155": "Ah, l'humble Concombre de mer. L'une des rares créatures enchantées qui errent sur cette terre… La doublure de son estomac fait une excellente gourde pour les potions une fois tannée. Je te remercie."
}